_Rarzrabotki/Kazna/AccumulationRegisters/ДенежныеСредстваПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваПроектов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСРасчетногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ДенежныеСредстваПроектов/Ext/RecordSetModule.bsl
Процедура ВыполнитьДвижениеОбщая(Объект, ЭтоРасход)
	
	МетаданныеОбъекта = Объект.Метаданные();
	Если ЭтоРасход Тогда
		НоваяСтрока = ДобавитьРасход();
	Иначе	
	     НоваяСтрока = ДобавитьПриход();
	КонецЕсли;
	
	
	Если МетаданныеОбъекта.Реквизиты.Найти("ДатаОплаты")<>Неопределено
		И ЗначениеЗаполнено(Объект.ДатаОплаты) Тогда
		НоваяСтрока.Период = Объект.ДатаОплаты;
	Иначе
		НоваяСтрока.Период = Объект.Дата;
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("Подразделение")<>Неопределено Тогда
		НоваяСтрока.Подразделение = Объект.Подразделение;
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("Организация")<>Неопределено Тогда
		НоваяСтрока.Организация = Объект.Организация;
	КонецЕсли;

	НоваяСтрока.Сумма = Окр(Объект.СуммаДокумента*0.2,2);
	
	Записывать = Истина;
	
КонецПроцедуры


Процедура ВыполнитьДвижение(Объект) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
			
	ЭтоРасход = Ложь;
	
	Если Объект.Дата<Дата(2016,10,01) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипОбъекта=Тип("ДокументОбъект.ПриходныйКассовыйОрдер")   Тогда 
		Если Объект.ВидОперации <> Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта=Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
		Если Объект.ВидОперации <> Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя Тогда
			Возврат;
		КонецЕсли;

		Если НЕ Объект.Оплачено Тогда
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта=Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
		ЭтоРасход = Истина;
		Возврат;
	ИначеЕсли ТипОбъекта=Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		ЭтоРасход = Истина;
		Возврат;
	КонецЕсли; 
	
	ВыполнитьДвижениеОбщая(Объект, ЭтоРасход);
	
КонецПроцедуры
